var app = new Vue({
    el: "#app",
    data: {
        "events": [
            {
                date: "04.09.22",
                event: "Сервак создан"
            },
            {
                date: "05.11.22",
                event: "Шлюха по имени robertkamar404#1510 по рофлу кинул репорт на админов якобы о том, что мы младше 13 лет. Пидирас. За это он был забанен нахуй. Пруфы удалены (плачь дура меня разбанили)"
            },
            {
                date: "09.11.22",
                event: "Андрей витальевич накрутил 350 ботов на сервер просрав 1 доллар. нахуя? незнаю"
            },
            {
                date: "10.11.22",
                event: "в 2 ночи были сброшены все приглашения на сервер чтобы боты больше не заходили"
            },
            {
                date: "04.02.23",
                event: "сервер получил 3 лвл буства и просрал на следующий день"
            },
            {
                date: "06.02.23 12:48",
                event: "СЕРВЕР БЛОКНУЛИ ПИЗДЕЦ. щас 13:11 и мы создаем новый и собираем тех кто был из важных хуев"
            },
            {
                date: "15.02.23",
                event: "нам заблокали акк с овнеркой, переезжаем"
            },
            {
                date: "08.03.23",
                event: "СЕРВЕР ЗАХВАТИЛ СРАКС пиздец"
            },
            {
                date: "09.03.23",
                event: "сервер освободили путём самоуничтожения"
            },
            {
                date: "01.04.23",
                event: "захвачен сервер с 3к уч"
            },
            {
                date: "08.04.23",
                event: "был крашнут майнкрафт сервер скайбарс с 13к уч"
            },
            {
                date: "09.04.23 23:00",
                event: "пиздец рп снова овнер ура"
            },
            {
                date: "04.05.23",
                event: "нас жеско переблокали, задели токенобазу навальнят и изза этого ебнули основу PZ DC#0706"
            }
        ],
        "popjopi" : [
            {
                "ava": "https://cdn.discordapp.com/avatars/942517025908064358/150cfead9da882962f2fc83e33082f7e.webp?size=40",
                "nick": "PZ DC#0706",
                "description": "Овнер ПКССМ. В числе учасников еще со времен зарождения БСДО. Ah fuck you, leatherman"
            },
            {
                "ava": "https://cdn.discordapp.com/avatars/855504190365499433/32b60d6bbd09a81def77346edfa3b27b.webp?size=40",
                "nick": "Putlёr#(тег скрыт)",
                "description": "Овнер ПКССМ. В числе учасников еще со времен зарождения БСДО. Любит писать латиницей"
            },
            {
                "ava": "https://cdn.discordapp.com/avatars/891882505467211876/10483395f8889e268638812ef6c423b2.webp?size=48",
                "nick": "Title#2892",
                "description": "Овнер ПКССМ. В числе учасников со времен распада РСА и Рекрута. Дрочер си шарпа"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/662608726339092490/ac72883d4c43bad37ecf8fe9d4eaba4f.webp?size=40",
                "nick": "Citizen#0709",
                "description": "Овнер ПКССМ. В числе учасников во зарождения БСДО. Был овнером рекрута. Ceo of world"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/576142671819571231/d83abd79188a11ff1bce897ab649d2b1.webp?size=40",
                "nick": "pixelik#4990",
                "description": "Друг овнеров. В числе учасников с первого БСДО. Желтый фурри баран"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/952256354326839356/a7e51bd6fd4ab79b37afb47822568868.webp?size=40",
                "nick": "Вор Володя Плутин#7413",
                "description": "Пидорас гнида и хуесос. Спиздил овнерку и угробил сервер"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/855770554920075275/aeafd8af35f4876b3244101f56df859c.webp?size=40",
                "nick": "Викуся#1346",
                "description": "Подруга админов и проститутка. В числе учасников со времен зарождения ПКССМ. Не выходит на связь уже как полгода(щас 10.04.23)"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/1023878135999107072/a_ce70f6b2eb7cfc00cd19fd57fd1dc3a6.gif?size=40",
                "nick": "Uwutaku#0001",
                "description": "Чел который выиграл Pizdec RP в дуэле в бравл старс и таким образом получил роль. ПрофесиАНАЛЬНЫЙ дудосер с фрисофтом. В числе учасников с начала зарождения ПКССМ, сдох"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/693861733558779934/983254d2e6498a2d1fb3cd227eea1597.webp?size=40",
                "nick": "kostoli#6581",
                "description": "Стал админом за счет актива в чате. Уважает гитлера. Пришел на ПКССМ в середине его развития, мало активит"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/855504361001844796/3bc626a411c5159354bfd4d3855dc182.webp?size=40",
                "nick": "севен#1929",
                "description": "Олд БСДО, АБС и рейдерских параш. Более известен как Seven_Seas. цитата: 'ну я типо олд крутой ебал жожо в роблоксе', щас его нет на пкссм"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/824687054121205820/6afc3efdf373d6074554b0189f908165.webp?size=40",
                "nick": "platoshka#0693",
                "description": "Олд всего мира. Ветеран рейдов с гангстером. С нами со времен 1го бсдо. Прошлый акк Pepe Frog#5430, не активен"
            }, 
            {
                "ava": "https://cdn.discordapp.com/avatars/467290739219496960/1b777e50adc9abc58b4ea172b9dc0e8a.webp?size=40",
                "nick": "ay0ks#(тег скрыт)",
                "description": "Олд рейдерства в дискорде, крутой челик. Дима трахай меня всего пж, щас его нет на пкссм"
            },
            {
                "ava": "https://cdn.discordapp.com/avatars/940627411832279070/9b5566e0a4a80379833fdcc04035ec28.webp?size=40",
                "nick": "nika-chan 猫#7241",
                "description": "Олд первого бсдо. Прошлый ник retr0. Очень крутой чел и адский дрочила, не активен"
            },
            {
                "ava": "https://cdn.discordapp.com/avatars/851363993628966933/6f6a7d32291a62115a141c365967f14b.webp?size=40",
                "nick": "Fedgoss#1488",
                "description": "Олд БСДО, АБСа и рейдерской движухи. Более известен под ником Носок. Лютый секси тип реально босс качалки"
            },
            {
                "ava": "https://cdn.discordapp.com/avatars/793156577926184981/bb3741f1fc9a0b35fc9d12ee7e35d840.webp?size=40",
                "nick": "tushkisha#4081",
                "description": "Наша новая (((живая))) личная проститутка сервера. Круто помогает в слежке за мамонтами и втиранию в доверие к пидорасам, мало активит"
            }
        ]
    }
});

//alert("Внимание сервер только что ебнули модеры дса так что вот новый заходите https://discord.gg/U9KzkZduWs")

function redirect() {
    window.location.href = 'ds.pkssm.keenetic.pro/';
}

function getssize() {
    
}
